Revit 2026 API

# IFCAnyHandleSetAttribute(String, Boolean) Method

---

Sets the attribute value.

**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetAttribute(
	string name,
	bool value
)
```
```vb
Public Sub SetAttribute (
	name As String,
	value As Boolean
)
```
```cpp
public:
void SetAttribute(
	String^ name,
	bool value
)
```
```fsharp
member SetAttribute :
        name : string *
        value : bool -> unit
```

#### Parameters

name String
     The attribute name.
value Boolean
     The value.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

IFCAnyHandle Class

SetAttribute Overload

Autodesk.Revit.DB.IFC Namespace